[


    {
        "id": 0,
        "name": "\"Allergy\"",
        "sinname":"අසාත්මිකතා",
        "symptom": "මුඛයේ හිරි වැටීම, තොල්, මුහුණ හෝ දිව ඉදිමීම, වද, සමේ කැසීම, කුෂ්ඨ හෝ වද, හුස්ම හිරවීම, මුහුණ ඉදිමීම, එම ස්ථානයේ ඉදිමීම, කැසීම හෝ වද, කැස්ස, හුස්ම හිරවීම, හුස්ම හිරවීම.",
        "precuation": "දරුවන් සඳහා, පිරවූ සතුන් ඇඳ තුළට ඉඩ නොතබන්න-ඔවුන් දූවිලි හා අනෙකුත් අසාත්මිකතා උගුලට හසුකර ගනී. නිවසේ කාපට් සහ බුමුතුරුණු වළක්වා ගැනීමට උත්සාහ කරන්න-ඔවුන් අසාත්මිකතාවන් මත රඳවා තබා ගනී; ඔබට කාපට් තිබේ නම්, හැකිතාක් දුරට රික්ත කරන්න. ඔබේ වායු සමීකරණ පෙරහන් නිතිපතා පිරිසිදු කරන්න-ඔබේ පෙරහන අසාත්මිකතා ඇති කරන තන්තු, පරාග, දූවිලි සහ අසාත්මිකතා ඇති කළ හැකි බොහෝ දේ උගුලට හසු කර ගනී. අසාත්මිකතා දිනපොතක් තබා ගන්න-ඔබේ රෝග ලක්ෂණ ඇතිවීමට හෝ වැඩි කිරීමට හේතුව සටහන් කරන්න; ඔබ ගන්නා ආහාර නිරීක්ෂණය කරන්න ප්‍රේරක සෙවීමට ඔබ කරන ක්‍රියාකාරකම්; උපකාර කිරීමට පෙනෙන දේ සටහන් කර එම තොරතුරු ඔබේ වෛද්‍යවරයා සමඟ බෙදා ගන්න",
        "description":"පරාග, දූවිලි හෝ රටකජු වැනි අප දිනපතා ජීවත් වන සමහර ද්‍රව්‍ය බොහෝ මිනිසුන්ට කරදර නොවිය හැකි නමුත් ඔබේ ප්‍රතිශක්තිකරණ පද්ධතිය ඒවා හානිකර දෙයක් ලෙස වරදවා වටහාගෙන අධික ලෙස ධාවනයට ගොස් එම අසාත්මිකතාවයට එරෙහිව සටන් කිරීමට ප්‍රතිදේහ නිපදවයි. පුස් බීජාණු, සුරතල් හිසේ කැක්කුම, කෘමීන් දෂ්ට කිරීම්, ආහාර, ඇතැම් ඖෂධ වර්ග සහ තවත් බොහෝ දේ ඇතුළත් වේ.",
        "Medicine_Name": "Diphenhydramine,Chlorpheniramine, Azelastine (Astelin, Astepro), Olopatadine (Patanase),Ketotifen (Alaway, Zaditor), Olopatadine (Pataday, Patanol, Pazeo), Pheniramine and naphazoline (Visine, Opcon-A, others).",
        "image": "https://img.freepik.com/free-vector/allergy-concept-with-symptoms-treatment-common-allergens-symbols-cartoon_1284-55530.jpg?w=740&t=st=1684246349~exp=1684246949~hmac=a6174a02d1b74f8509d801641cb239e06167049ee6f49d338933172b93f9d806"
    },


 
    {
        "id": 1,
        "name": "\"Common Cold\"",
        "sinname":"සෙම්ප්‍රතිශ්‍යාව",
        "symptom": "නාසයෙන් දියර ගැලීම හෝ හිරවීම, උගුරේ අමාරුව, කැස්ස, තදබදය, කිවිසුම් යාම, සාමාන්‍යයෙන් අසනීප බවක් දැනේ.",
        "precuation": "1. ලෙමන් යුෂ සහ මී පැණි තේ හැන්දක භාගයක් සමඟ මිශ්‍ර කර ඇති උණුසුම් ජලය සමඟ මුඛය තුළ තබා ගන්න. පිළිස්සීමට තුඩු දිය හැකි ජලය ඉතා උණුසුම් නොවන බවට වග බලා ගත යුතුය. \n 2. ලෙමන් සහ මී පැණි සමඟ තේ සහ අනෙකුත් උණුසුම් බීම තදබදය නැති කිරීමට සහ උගුරේ අමාරුව සමනය කිරීමට උපකාරී වේ. උණුසුම් සුප්, විශේෂයෙන් කුළුබඩු සහිත සුප්, නාසික ජලාපවහනය ප්‍රවර්ධනය කර හුස්ම ගැනීම පහසු කරයි. \n 3. උණුසුම් වාෂ්ප ආශ්වාස කිරීමෙන් නාසික තදබදය සහ සයිනස් පීඩනය තාවකාලිකව අඩු විය හැක. උණුසුම් වාෂ්ප සඳහා විකල්පයක් වන්නේ උතුරන වතුර භාජනයක් පුරවා, තුවායක් භාවිතයෙන් හිස වසාගෙන වාෂ්ප ආශ්වාස කිරීමයි. 4. නාසය නිවැරදිව පිඹින්න, ඔබ එක් නාස්පුඩුවක් අවහිර කර ටිෂූ කඩදාසියකට මෘදු ලෙස පිඹින්න, ඉන්පසු මාරු කරන්න විරුද්ධ නාස්පුඩුව අවහිර කර පිඹින්න",
        "description":"සෙම්ප්‍රතිශ්‍යාව යනු ඔබේ නාසයේ සහ උගුරේ (ඉහළ ශ්වසන මාර්ගය) වෛරස් ආසාදනයකි. එය සාමාන්‍යයෙන් හානිකර නොවන නමුත් එය එසේ දැනෙන්නේ නැත. බොහෝ වෛරස් වර්ග සෙම්ප්‍රතිශ්‍යාව ඇති කළ හැක.        ",
        "Medicine_Name": "පැරසිටමෝල්, ඉබුප්‍රොෆෙන්, ඩිකොන්ගස්ටන්ට් සහ සේලයින් නාසික ඉසින හෝ බිංදු අවහිර වී ඇති නාසයට සහනයක්.",
        "image": "https://img.freepik.com/free-vector/young-man-having-cold_23-2148484108.jpg?w=740&t=st=1684259292~exp=1684259892~hmac=d8711dfa427b4b9597fd8d2e44f6787f7571645d5d7fdb027195b64c68e41877"
    },

 

 

    {
        "id": 2,
        "name": "\"Gastroenteritis\"",
        "sinname":"ආමාශ ආන්ත්රයික රෝග",
        "symptom": "ජලය සහිත, සාමාන්‍යයෙන් ලේ රහිත පාචනය - ලේ පාචනය සාමාන්‍යයෙන් අදහස් කරන්නේ ඔබට වෙනස්, වඩා දරුණු ආසාදනයක් ඇති බවයි. ඔක්කාරය, වමනය හෝ දෙකම, බඩේ කැක්කුම සහ වේදනාව, වරින් වර මාංශ පේශි කැක්කුම හෝ හිසරදය.",
        "precuation": "දිනපතා සබන් යොදා අත් සේදීම. ක්ෂණික ආහාර අනුභව නොකරන්න. ගෙදර හැදූ ආහාර අනුභව කරන්න. ඔහුගේ දේවල් භාවිතා නොකරන්න. ටැප් වතුර බොන්න එපා, පාරේ කෑම කන්න එපා.",
        "description":" අපහසු රෝගයකි,සංවර්ධිත රටවල කලාතුරකින් ජීවිතයට තර්ජනයක් වේ. ඉන්ෆ්ලුවෙන්සා වෛරසය මෙම රෝගය සමඟ සම්බන්ධ නොවූවත් වෛරස් ආමාශ ආන්ත්රයික හෝ බඩවැල් උණ ලෙස නිතර හැඳින්වේ.",
        "Medicine_Name": "ondansetron, doxycycline, ceftriaxone, Vibramycin,  Doxy 100, ampicillin, Morgidox.",
        "image": "https://img.freepik.com/premium-photo/woman-touching-stomach-painful-suffering-from-stomachache-causes-menstruation-period-gastric_34200-643.jpg?w=1380"
    },




    {
        "id": 3,
        "name": "\"Migraine\"",
        "sinname":"ඉරුවාරදය",
        "symptom": "ආලෝකයට, ශබ්දයට හෝ සුවඳට සංවේදී වීම, තෙහෙට්ටුව, ආහාර රුචිය හෝ ආහාර රුචිය නොමැතිකම, මනෝභාවය වෙනස් වීම, දැඩි පිපාසය.",
        "precuation": "1. විදුලි පහන් නිවා දමන්න. ආලෝකය සහ ශබ්දය ඉරුවාරදය වේදනාව තවත් නරක අතට හැරිය හැක. අඳුරු, නිහඬ කාමරයක විවේක ගන්න. නිදාගන්න. 2. උෂ්ණත්ව චිකිත්සාව උත්සාහ කරන්න. ඔබේ හිසට හෝ බෙල්ලට උණුසුම් හෝ සීතල සම්පීඩන යොදන්න. අයිස් පැකට් වල හිරිවැටීමක් ඇත බලපෑම, වේදනාව අඳුරු විය හැක. උණුසුම් ඇසුරුම් සහ තාපන පෑඩ් ආතතියෙන් යුත් මාංශ පේශි ලිහිල් කළ හැකිය. උණුසුම් ස්නානය හෝ ස්නානය සමාන බලපෑමක් ඇති කළ හැකිය. \n 3. කැෆේන් සහිත පානයක් බොන්න. කුඩා ප්රමාණවලින්, කැෆේන් පමණක් මුල් අවධියේදී ඉරුවාරදය වේදනාව සමනය කළ හැකිය.කැෆේන් ඇසිටමිනොෆෙන් (ටයිලෙනෝල්, වෙනත්) සහ ඇස්පිරින් වල වේදනාව අඩු කිරීමේ බලපෑම් වැඩි දියුණු කළ හැකිය. \n 4. නිතිපතා නිදාගන්නා වේලාවන් ස්ථාපිත කරන්න. සෑම දිනකම එකම වේලාවක අවදි වී නින්දට යන්න - සති අන්තවල පවා.ඔබ දිවා කාලයේ නිදා ගන්නේ නම් එය කෙටියෙන් තබන්න.(විනාඩි 20 - 30)",
        "description":"ඉරුවාරදය යනු ස්නායු ආබාධයක් වන අතර එය බොහෝ විට දැඩි හිසරදයක් ඇති කරයි. හිසරදය කාලයෙන් කාලයට පැමිණෙන අතර සමහර විට ඔක්කාරය, වමනය සහ ආලෝකයට සංවේදීතාව ද පැමිණේ.",
        "Medicine_Name": "Almotriptan (Axert), Eletriptan (Relpax), Frovatriptan (Frova), Naratriptan (Amerge), Rizatriptan (Maxalt),Sumatriptan (Alsuma, Imitrex, Onzetra, Sumavel, Zembrace),Zolmitriptan (Zomig).",
        "image": "https://img.freepik.com/free-vector/man-showing-symptoms-virus-vector_53876-169033.jpg?w=740&t=st=1684259464~exp=1684260064~hmac=c22a87aac3790809e1b729cb158f378db31e746ab97d528ef7220fd55f1a716a"
    },
 
   
   
    {
        "id": 4,
        "name": "\"Urinary tract infection\"",
        "sinname":"මුත්රා ආසාදන",
        "symptom": "නැති නොවන මුත්‍රා කිරීමට දැඩි ආශාවක්, මුත්‍රා කරන විට දැවෙන හැඟීමක්, නිතර මුත්‍රා කිරීම සහ කුඩා ප්‍රමාණයකින් මුත්‍රා පිටවීම.",
        "precuation": "1.ඔබේ ශරීරයෙන් බැක්ටීරියා ඉවත් කිරීමට උදව් කිරීමට ජලය ගොඩක් බොන්න. ඔබේ වෛද්‍යවරයා ඔබට ඖෂධයක් ද ලබා දිය හැක වේදනාව සමනය කිරීමට. ඔබට තාපන පෑඩ් ප්රයෝජනවත් විය හැකිය. ක්රැන්බෙරි යුෂ බොහෝ විට වැළැක්වීම සඳහා හෝ ප්රවර්ධනය කරයි UTI වලට ප්‍රතිකාර කරන්න. \n 2. මුත්‍රා කිරීමට අවශ්‍ය යැයි ඔබට හැඟුණු වහාම ඔබේ මුත්‍රාශය හිස් කරන්න; ඉක්මන් නොවන්න, ඔබේ මුත්රාශය සම්පූර්ණයෙන්ම ඔබ හිස් කර ඇති බවට වග බලා ගන්න.",
        "description":"මුත්රා ආසාදන (UTI) යනු මුත්රා පද්ධතියේ ඕනෑම කොටසක ආසාදනයකි. මුත්රා පද්ධතියට වකුගඩු, මුත්රා, මුත්රාශය සහ මුත්රා ඇතුළත් වේ. බොහෝ ආසාදන පහළ මුත්රා මාර්ගයට සම්බන්ධ වේ",
        "Medicine_Name": "homeaPet, uralix, amoxicillin.",
        "image": "https://img.freepik.com/premium-photo/young-man-holding-his-crotch-tissue-paper-suffer-from-diarrhea-incontinence-prostatitis-venereal_59017-1065.jpg?w=1380"
    }

]